Дошкольное_учреждение83/src/Documents/удуОприходованиеТМЦ/удуОприходованиеТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удуОприходованиеТМЦ</name>
  <registerRecords>AccumulationRegister.удуТМЦ_НаСкладах</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.удуСклады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладыВТабличнойЧасти</name>
    <comment>Указывать склады в таб. части</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.удуВидыОперацийПриходТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПокпкаЧерезПодотчетноеЛицо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КВД</name>
    <type>
      <types>EnumRef.удуКВД</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПервичногоДокумента</name>
    <type>
      <types>CatalogRef.удуВидыПервичныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПервичногоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПервичногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТМЦ</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.удуНоменклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>CatalogRef.удуИнвентарныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.удуСклады</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УчетныеЕдиницы</name>
    <attributes>
      <name>УчетнаяЕдиница</name>
      <type>
        <types>CatalogRef.удуУчетныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>CatalogRef.удуИнвентарныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.удуСклады</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дошкольное_учреждение83/src/AccumulationRegisters/удуТМЦ_НаСкладах/удуТМЦ_НаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>удуТМЦ_НаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.удуСклады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.удуНоменклатура</types>
      <types>CatalogRef.удуУчетныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>CatalogRef.удуИнвентарныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КВД</name>
    <type>
      <types>EnumRef.удуКВД</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Дошкольное_учреждение83/src/Documents/удуОприходованиеТМЦ/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если СкладыВТабличнойЧасти Тогда
		ПроверяемыеРеквизиты.Добавить("ТМЦ.Склад");
		ПроверяемыеРеквизиты.Добавить("УчетныеЕдиницы.Склад");
	Иначе
		ПроверяемыеРеквизиты.Добавить("Склад");
	КонецЕсли;
	
КонецПроцедуры

Процедура ДвиженияПоУчетуТМЦ(Отказ)
	
	Движения.удуТМЦ_НаСкладах.Записывать = Истина;
	Для Каждого ТекСтрокаТМЦ Из ТМЦ Цикл
		// регистр удуТМЦ_НаСкладах Приход
		// таб часть "ТМЦ"
		Движение = Движения.удуТМЦ_НаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период      = Дата;
		Движение.Учреждение  = Организация;
		
		Если СкладыВТабличнойЧасти Тогда
			Движение.Склад = ТекСтрокаТМЦ.Склад;
		Иначе
			Движение.Склад = Склад;
		КонецЕсли;

		Движение.ИнвентарныйНомер = ТекСтрокаТМЦ.ИнвентарныйНомер;
		Движение.Номенклатура     = ТекСтрокаТМЦ.Номенклатура;
		Движение.КВД              = КВД;
		Движение.Количество       = ТекСтрокаТМЦ.Количество;
	КонецЦикла;

	
	Для Каждого ТекСтрокаУЕд Из УчетныеЕдиницы Цикл
		// регистр удуТМЦ_НаСкладах Приход
		// таб часть "УчетныеЕдиницы"
		Движение = Движения.удуТМЦ_НаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период      = Дата;
		Движение.Учреждение  = Организация;
		
		Если СкладыВТабличнойЧасти Тогда
			Движение.Склад = ТекСтрокаУЕд.Склад;
		Иначе
			Движение.Склад = Склад;
		КонецЕсли;
		
		Движение.ИнвентарныйНомер = ТекСтрокаУЕд.ИнвентарныйНомер;
		Движение.Номенклатура     = ТекСтрокаУЕд.УчетнаяЕдиница;
		Движение.КВД              = КВД;
		Движение.Количество       = ТекСтрокаУЕд.Количество;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
		
    ДвиженияПоУчетуТМЦ(Отказ); 	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры
